[
    { "id": "truth-210", "truth": "A project is finished when the budget is gone, not when the work is done." },
  { "id": "truth-211", "truth": "Wally’s law: If you never do any work, you’ll never have to redo it." },
  { "id": "truth-212", "truth": "The quality of a decision is inversely proportional to the number of people in the meeting." },
  { "id": "truth-213", "truth": "Status reports are just creative writing for engineers." },
  { "id": "truth-214", "truth": "The 'Vision' for a project is usually a hallucination from a management retreat." },
  { "id": "truth-215", "truth": "An expert is anyone from out of town with a PowerPoint deck." },
  { "id": "truth-216", "truth": "The goal of a reorganization is to hide the failure of the previous one." },
  { "id": "truth-217", "truth": "Carrying a coffee mug makes you look too busy to be interrupted." },
  { "id": "truth-218", "truth": "The boss’s technical knowledge is a dangerous mix of buzzwords and overconfidence." },
  { "id": "truth-219", "truth": "A 'stretch goal' is a task that is physically impossible to achieve." },
  { "id": "truth-220", "truth": "The person who says 'it’s a win-win' is the only one winning." },
  { "id": "truth-221", "truth": "Corporate culture is what happens when you ignore the people actually working." },
  { "id": "truth-222", "truth": "The more you explain it, the more the boss thinks it’s easy." },
  { "id": "truth-223", "truth": "A 'Strategic Partnership' is two companies failing together." },
  { "id": "truth-224", "truth": "Efficiency is the art of avoiding tasks that have no purpose." },
  { "id": "truth-225", "truth": "The amount of 'collaboration' required is directly related to the lack of leadership." },
  { "id": "truth-226", "truth": "Leadership is the art of taking credit for things that happened by accident." },
  { "id": "truth-227", "truth": "The 'Next Big Thing' is just the Last Big Thing with a new logo." },
  { "id": "truth-228", "truth": "If you act like you know what you’re doing, people will leave you alone." },
  { "id": "truth-229", "truth": "Innovation is just a fancy word for 'trying something that won't work'." },
  { "id": "truth-230", "truth": "A 'Brainstorming Session' is where good ideas go to die." },
  { "id": "truth-231", "truth": "The boss’s priority is whatever he read in an airplane magazine this morning." },
  { "id": "truth-232", "truth": "Work-life balance is a myth told to new hires during orientation." },
  { "id": "truth-233", "truth": "The complexity of a task expands to fit the number of managers involved." },
  { "id": "truth-234", "truth": "An 'Urgent Request' is usually a task someone forgot about for three weeks." },
  { "id": "truth-235", "truth": "The most productive part of the day is the hour after the boss leaves." },
  { "id": "truth-236", "truth": "Synergy is the sound of two departments bumping heads." },
  { "id": "truth-237", "truth": "A 'flat hierarchy' means you have twelve bosses instead of one." },
  { "id": "truth-238", "truth": "Professionalism is the mask you wear to keep from laughing during meetings." },
  { "id": "truth-239", "truth": "The office coffee is the only thing more bitter than the staff." },
  { "id": "truth-240", "truth": "A 'Pivot' is a fancy way of saying 'We have no idea what we're doing'." },
  { "id": "truth-241", "truth": "The best way to be invisible is to volunteer for a committee that never meets." },
  { "id": "truth-242", "truth": "Training is a way to ensure everyone makes the same mistakes." },
  { "id": "truth-243", "truth": "Mentorship is just a senior person telling you how things used to be better." },
  { "id": "truth-244", "truth": "The budget is a list of things you can’t have." },
  { "id": "truth-245", "truth": "A 'Team Building Exercise' is a way to make everyone hate each other equally." },
  { "id": "truth-246", "truth": "The boss’s door is always open, but his mind is always closed." },
  { "id": "truth-247", "truth": "A 'Mission Statement' is a paragraph that means nothing to everyone." },
  { "id": "truth-248", "truth": "Promotion is the reward for being the best at pretending to work." },
  { "id": "truth-249", "truth": "Performance reviews are based on how much the boss remembers from last week." },
  { "id": "truth-250", "truth": "If you don't know what you're doing, do it with 'Agile' enthusiasm." },
  { "id": "truth-251", "truth": "The 'Cloud' is just a way to pay for someone else’s mistakes monthly." },
  { "id": "truth-252", "truth": "Scalability is a problem you'll never have for a product nobody wants." },
  { "id": "truth-253", "truth": "User feedback is a polite way of being told your design is terrible." },
  { "id": "truth-254", "truth": "A 'Minor Tweak' usually involves rewriting the entire backend." },
  { "id": "truth-255", "truth": "The office printer can smell fear and will jam accordingly." },
  { "id": "truth-256", "truth": "A deadline is a date that exists solely to be moved." },
  { "id": "truth-257", "truth": "Best practices are the things everyone talks about but nobody does." },
  { "id": "truth-258", "truth": "An 'Open Office' is a way to ensure no one gets any work done together." },
  { "id": "truth-259", "truth": "The ultimate goal of any corporation is to replace people with spreadsheets." },
  { "id": "truth-260", "truth": "An 'On-Call' rotation is just a way to ensure employees never truly stop working." },
  { "id": "truth-261", "truth": "HR defines 'Senior Engineer' as anyone who hasn't quit in the last six months." },
  { "id": "truth-262", "truth": "Performance metrics are designed to reward those who create problems and then fix them." },
  { "id": "truth-263", "truth": "A 'Market Adjustment' is what we call a raise that is still below inflation." },
  { "id": "truth-264", "truth": "Unlimited PTO is a psychological trap to make you feel guilty for taking a Tuesday off." },
  { "id": "truth-265", "truth": "The 'Greatest Asset' of the company is the one we are currently trying to outsource." },
  { "id": "truth-266", "truth": "Employee engagement surveys are used to identify who still has hope, so we can fix that." },
  { "id": "truth-267", "truth": "A 'Competitive Salary' means we pay exactly one dollar more than the worst company in town." },
  { "id": "truth-268", "truth": "We value your 'Work-Life Balance' as long as the 'Life' part happens between 2 AM and 4 AM." },
  { "id": "truth-269", "truth": "The 'Standard Tech Stack' is chosen by the person who can be bribed with the cheapest lunch." },
  { "id": "truth-270", "truth": "Retention bonuses are just ransoms we pay to people we should have treated better." },
  { "id": "truth-271", "truth": "An 'Exit Interview' is a formal process for ignoring why people are actually leaving." },
  { "id": "truth-272", "truth": "The 'Culture Fit' interview is a filter for people who won't complain about the broken CI/CD." },
  { "id": "truth-273", "truth": "We call it 'Upskilling' when we give you three people's jobs for the price of one." },
  { "id": "truth-274", "truth": "The 'Employee of the Month' is usually the person whose login hasn't been seen in the logs." },
  { "id": "truth-275", "truth": "Mandatory training is the only time developers are allowed to be idle without being judged." },
  { "id": "truth-276", "truth": "A 'Horizontal Move' is a way to give you more work without changing your title or pay." },
  { "id": "truth-277", "truth": "The 'Hiring Freeze' only applies to the roles that would actually make your life easier." },
  { "id": "truth-278", "truth": "We use 'Agile' because it's easier to track your micro-failures every two weeks." },
  { "id": "truth-279", "truth": "A 'Bonus' is a theoretical concept used to keep you from leaving before the end of Q4." },
  { "id": "truth-280", "truth": "The 'Office Perk' of free snacks is a calculated investment to keep you from leaving for lunch." },
  { "id": "truth-281", "truth": "Remote work is a privilege we threaten to revoke whenever the CEO feels lonely." },
  { "id": "truth-282", "truth": "The 'Tech Debt' we ignore today is the 'Critical Emergency' we’ll blame you for tomorrow." },
  { "id": "truth-283", "truth": "Job descriptions are written by people who think 'Java' and 'JavaScript' are siblings." },
  { "id": "truth-284", "truth": "The 'Open Floor Plan' was invented to make sure no one accidentally enjoys their job." },
  { "id": "truth-285", "truth": "If your code is easy to maintain, you are making yourself too easy to replace." },
  { "id": "truth-286", "truth": "The 'Annual Review' is an exercise in finding one minor mistake to justify a 2% raise." },
  { "id": "truth-287", "truth": "We promote the most incompetent people so they can stop breaking the codebase." },
  { "id": "truth-288", "truth": "A 'Collaborative Environment' means you are responsible for everyone else's mistakes." },
  { "id": "truth-289", "truth": "Transparency is a one-way mirror: we see everything you do; you see nothing we decide." },
  { "id": "truth-290", "truth": "The 'Company Mission' is just a screensaver designed to mask the sound of your despair." },
  { "id": "truth-291", "truth": "DevOps is the perfect HR strategy: developers now have to fire themselves when the site goes down." },
  { "id": "truth-292", "truth": "We value 'Creative Problem Solving,' unless your solution involves spending any money." },
  { "id": "truth-293", "truth": "An 'Inclusive Workspace' means we ignore everyone's technical concerns equally." },
  { "id": "truth-294", "truth": "The 'Internal Tool' you built will be replaced by a SaaS that does half the work for ten times the cost." },
  { "id": "truth-295", "truth": "We call it a 'Pivot' when we realize the developers were right six months ago." },
  { "id": "truth-296", "truth": "The 'Security Audit' is a list of things we’ll fix as soon as we get hacked." },
  { "id": "truth-297", "truth": "Your 'Passionate Commitment' is just a fancy way of saying you have no hobbies." },
  { "id": "truth-298", "truth": "The 'Cloud Migration' is a strategic move to ensure we can't blame our own hardware anymore." },
  { "id": "truth-299", "truth": "A 'Full-Stack Developer' is an HR term for a person who will be burnt out in 18 months." },
  { "id": "truth-300", "truth": "If you automate your job, you've just provided us with a reason to fire you." },
  { "id": "truth-301", "truth": "The 'Legacy System' is the only thing standing between the company and total collapse." },
  { "id": "truth-302", "truth": "We don't have 'Bugs,' we have 'Unscheduled Feature Divergences'." },
  { "id": "truth-303", "truth": "The 'Technical Roadmap' is a work of fiction that would make Tolkien jealous." },
  { "id": "truth-304", "truth": "Your 'Autonomy' ends the moment the boss sees a new shiny object." },
  { "id": "truth-305", "truth": "A 'Reorg' is the corporate version of 'Have you tried turning it off and on again?'" },
  { "id": "truth-306", "truth": "The 'Employee Handbook' is a 400-page document explaining why nothing is our fault." },
  { "id": "truth-307", "truth": "We encourage 'Feedback' so we can track who the troublemakers are." },
  { "id": "truth-308", "truth": "The 'Innovation Lab' is where we send the developers we can't trust with production code." },
  { "id": "truth-309", "truth": "Management is the art of moving the goalposts while the ball is in the air." },


  { "id": "truth-001", "truth": "You write code faster than you read it." },
  { "id": "truth-002", "truth": "Most bugs come from assumptions, not syntax." },
  { "id": "truth-003", "truth": "Meetings often replace actual work." },
  { "id": "truth-004", "truth": "Deadlines make you cut corners." },
  { "id": "truth-005", "truth": "Tests are written after the code breaks." },
  { "id": "truth-006", "truth": "Code reviews find your mistakes, not theirs." },
  { "id": "truth-007", "truth": "You fix the same bug multiple times." },
  { "id": "truth-008", "truth": "Documentation is always outdated." },
  { "id": "truth-009", "truth": "Refactoring feels good but breaks things." },
  { "id": "truth-010", "truth": "You ignore warnings until they become errors." },
  { "id": "truth-011", "truth": "Code comments explain the obvious." },
  { "id": "truth-012", "truth": "You learn more from failures than successes." },
  { "id": "truth-013", "truth": "Simple solutions are often overlooked." },
  { "id": "truth-014", "truth": "Time estimates are always wrong." },
  { "id": "truth-015", "truth": "You write code you don't understand." },
  { "id": "truth-051", "truth": "The person who talks the most about productivity is avoiding work." },
  { "id": "truth-052", "truth": "The urgent task is rarely the important one." },
  { "id": "truth-053", "truth": "Most decisions are made before the meeting starts." },
  { "id": "truth-054", "truth": "The plan only works until reality shows up." },
  { "id": "truth-055", "truth": "Someone will always suggest rewriting everything." },
  { "id": "truth-056", "truth": "The clearer your explanation, the less people listen." },
  { "id": "truth-057", "truth": "The person who assigns the task will never do it." },
  { "id": "truth-058", "truth": "The bigger the launch, the smaller the testing window." },
  { "id": "truth-059", "truth": "You will debug something you didn't change." },
  { "id": "truth-060", "truth": "Most problems are discovered by users, not systems." },
  { "id": "truth-061", "truth": "The process exists because something broke once." },
  { "id": "truth-062", "truth": "The fastest way to delay work is to optimize it." },
  { "id": "truth-063", "truth": "Someone will ask for changes after approval." },
  { "id": "truth-064", "truth": "The simplest explanation is usually ignored first." },
  { "id": "truth-065", "truth": "Every shortcut adds a future meeting." },
  { "id": "truth-066", "truth": "The person who wants it fastest will review it slowest." },
  { "id": "truth-067", "truth": "Work expands to fill the deadline." },
  { "id": "truth-068", "truth": "The issue you can't explain is the one you caused." },
  { "id": "truth-069", "truth": "The longer the thread, the less anyone reads it." },
  { "id": "truth-070", "truth": "The system behaves exactly as it was built, not as intended." },
  { "id": "truth-071", "truth": "If everyone agrees immediately, someone misunderstood." },
  { "id": "truth-072", "truth": "The more slides there are, the less clarity there is." },
  { "id": "truth-073", "truth": "Most urgency is manufactured." },
  { "id": "truth-074", "truth": "You will fix something that was not broken." },
  { "id": "truth-075", "truth": "The person most confident is usually guessing." },
  { "id": "truth-076", "truth": "The real bottleneck is usually approval." },
  { "id": "truth-077", "truth": "The feature request describes a symptom, not the problem." },
  { "id": "truth-078", "truth": "The more stakeholders, the slower the truth." },
  { "id": "truth-079", "truth": "Someone will propose a solution before hearing the problem." },
  { "id": "truth-080", "truth": "You will understand the issue right after explaining it." },
  { "id": "truth-081", "truth": "Every tool promises simplicity and delivers configuration." },
  { "id": "truth-082", "truth": "The system that cannot fail is already failing quietly." },
  { "id": "truth-083", "truth": "Someone will ask for metrics no one plans to read." },
  { "id": "truth-084", "truth": "The explanation that makes sense is the one people doubt." },
  { "id": "truth-085", "truth": "The more approvals required, the less ownership exists." },
  { "id": "truth-086", "truth": "The problem marked minor becomes critical." },
  { "id": "truth-087", "truth": "Someone will test it in a way you never imagined." },
  { "id": "truth-088", "truth": "The system is only stable because nobody touched it." },
  { "id": "truth-089", "truth": "The person who wrote it is no longer here." },
  { "id": "truth-090", "truth": "Every roadmap is optimistic fiction." },
  { "id": "truth-091", "truth": "The more planning there is, the less clarity remains." },
  { "id": "truth-092", "truth": "The real issue is always discovered last." },
  { "id": "truth-093", "truth": "You will fix it after someone watches you fail." },
  { "id": "truth-094", "truth": "The person who said it was easy has never done it." },
  { "id": "truth-095", "truth": "The task that looks small hides the most dependencies." },
  { "id": "truth-096", "truth": "The more documentation exists, the less it is trusted." },
  { "id": "truth-097", "truth": "The fastest solution creates the slowest maintenance." },
  { "id": "truth-098", "truth": "Someone will blame the system before reading it." },
  { "id": "truth-099", "truth": "The last change is always suspected first." },
  { "id": "truth-100", "truth": "You will eventually understand code you once feared." },
  { "id": "truth-101", "truth": "It worked on my machine is the first stage of grief." },
  { "id": "truth-102", "truth": "DevOps is just developers doing the stuff they used to hate." },
  { "id": "truth-103", "truth": "A temporary fix is the most permanent thing in the codebase." },
  { "id": "truth-104", "truth": "The CI pipeline only fails when you are about to leave for dinner." },
  { "id": "truth-105", "truth": "YAML is just a very sensitive way to yell at a cloud." },
  { "id": "truth-106", "truth": "DNS is always the prime suspect, even when it isn't." },
  { "id": "truth-107", "truth": "There is no 'Cloud,' just someone else's computer on fire." },
  { "id": "truth-108", "truth": "Automating a mess just makes the mess happen faster." },
  { "id": "truth-109", "truth": "Senior developers are just junior developers who have broken more things." },
  { "id": "truth-110", "truth": "The 'Force Push' is the 'I give up' of version control." },
  { "id": "truth-111", "truth": "Microservices turn your code problems into networking problems." },
  { "id": "truth-112", "truth": "A 'Quick Sync' is never quick." },
  { "id": "truth-113", "truth": "Deleting code is more satisfying than writing it." },
  { "id": "truth-114", "truth": "Legacy code is just code that actually makes the company money." },
  { "id": "truth-115", "truth": "The environment you didn't test is the one where the bug lives." },
  { "id": "truth-116", "truth": "Dark mode is the only true way to write code." },
  { "id": "truth-117", "truth": "Naming things is 90% of the difficulty of engineering." },
  { "id": "truth-118", "truth": "Regex is a way to solve one problem by creating two more." },
  { "id": "truth-119", "truth": "The louder the server fan, the closer you are to a promotion." },
  { "id": "truth-120", "truth": "Kubernetes is Greek for 'I have too much free time'." },
  { "id": "truth-121", "truth": "A deployment at 4:55 PM on a Friday is a cry for help." },
  { "id": "truth-122", "truth": "Containers only solve the problem of it working on your machine." },
  { "id": "truth-123", "truth": "Serverless just means the server is someone else's problem." },
  { "id": "truth-124", "truth": "The 'Dev' in DevOps finishes in a week; the 'Ops' takes a lifetime." },
  { "id": "truth-125", "truth": "Your 'Quick Fix' is the root cause of next month's outage." },
  { "id": "truth-126", "truth": "Automated tests are great until you have to maintain the tests." },
  { "id": "truth-127", "truth": "Technical debt is like a credit card: eventually, you hit the limit." },
  { "id": "truth-128", "truth": "The person who broke the build is usually the one who left for lunch." },
  { "id": "truth-129", "truth": "Microservices are just a way to have 50 small outages instead of one big one." },
  { "id": "truth-130", "truth": "The README is the first thing people ignore and the last thing they update." },
  { "id": "truth-131", "truth": "Everything is a 'High Priority' until the developer asks for a specification." },
  { "id": "truth-132", "truth": "The bug you can't reproduce in Staging is currently destroying Production." },
  { "id": "truth-133", "truth": "Logging everything is the same as logging nothing." },
  { "id": "truth-134", "truth": "Software estimation is just professional guessing under pressure." },
  { "id": "truth-135", "truth": "Cloud costs only go one way: up." },
  { "id": "truth-136", "truth": "A junior dev writes complex code; a senior dev writes simple code." },
  { "id": "truth-137", "truth": "Git rebase is for people who want to lie about how messy their work was." },
  { "id": "truth-138", "truth": "The most dangerous command is 'sudo' followed by 'I think this might work'." },
  { "id": "truth-139", "truth": "Monitoring tells you it's broken; Observability tells you why you're crying." },
  { "id": "truth-140", "truth": "The staging environment is just a more expensive version of 'not production'." },
  { "id": "truth-141", "truth": "If you don't have a test environment, you have a production environment where you test." },
  { "id": "truth-142", "truth": "The best way to get an answer on Slack is to post the wrong solution." },
  { "id": "truth-143", "truth": "Scalability is what you worry about when you should be worrying about usability." },
  { "id": "truth-144", "truth": "Agile is just doing the wrong thing in two-week intervals." },
  { "id": "truth-145", "truth": "A database is a place where data goes to be forgotten." },
  { "id": "truth-146", "truth": "The person who says 'it’s just a configuration change' is about to cause an outage." },
  { "id": "truth-147", "truth": "Legacy systems are the only ones that actually work." },
  { "id": "truth-148", "truth": "A firewall is a device that blocks the traffic you actually need." },
  { "id": "truth-149", "truth": "Cache invalidation is the second hardest problem; naming things is still first." },
  { "id": "truth-150", "truth": "Coffee is the fuel that converts tickets into technical debt." }
]
